In [1]:
import pandas as pd

<h1>Create two DataFrame</h1>

In [2]:
tmp_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'temperature': [32, 40, 38]
})

tmp_df

         city  temperature
0    Dinajpur           32
1       Dhaka           40
2  Chittagong           38

In [3]:
humidity_df = pd.DataFrame({
    'city': ['Dhaka', 'Dinajpur', 'Chittagong'],
    'humidity': [80, 60, 90]
})

humidity_df

         city  humidity
0       Dhaka        80
1    Dinajpur        60
2  Chittagong        90

<h1>Merge two DataFrames <span style="color:red">On</span> Cities</h1>

In [4]:
df = pd.merge(tmp_df, humidity_df, on='city')
df

         city  temperature  humidity
0    Dinajpur           32        60
1       Dhaka           40        80
2  Chittagong           38        90

<h1>Merge two DataFrames using different Cities</h1>

In [5]:
tmp_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'temperature': [32, 40, 38]
})

tmp_df

         city  temperature
0    Dinajpur           32
1       Dhaka           40
2  Chittagong           38

In [6]:
windspeed_df = pd.DataFrame({
    'city': ['Dinajpur', 'Chittagong', 'Rangpur'],
    'windspeed': [6, 9, 7]
})

windspeed_df

         city  windspeed
0    Dinajpur          6
1  Chittagong          9
2     Rangpur          7

In [7]:
df = pd.merge(tmp_df, windspeed_df, on='city')
df

         city  temperature  windspeed
0    Dinajpur           32          6
1  Chittagong           38          9

<h1>How = Inner (By default), Outer, Left, Right</h1>

In [8]:
df = pd.merge(tmp_df, windspeed_df, on='city', how='outer')
df

         city  temperature  windspeed
0    Dinajpur         32.0        6.0
1       Dhaka         40.0        NaN
2  Chittagong         38.0        9.0
3     Rangpur          NaN        7.0

<h3>Indicator on How</h3>

In [9]:
df = pd.merge(tmp_df, windspeed_df, on='city', how='outer', indicator=True)
df

         city  temperature  windspeed      _merge
0    Dinajpur         32.0        6.0        both
1       Dhaka         40.0        NaN   left_only
2  Chittagong         38.0        9.0        both
3     Rangpur          NaN        7.0  right_only

In [10]:
df = pd.merge(tmp_df, windspeed_df, on='city', how='left')
df

         city  temperature  windspeed
0    Dinajpur           32        6.0
1       Dhaka           40        NaN
2  Chittagong           38        9.0

In [11]:
df = pd.merge(tmp_df, windspeed_df, on='city', how='right')
df

         city  temperature  windspeed
0    Dinajpur         32.0          6
1  Chittagong         38.0          9
2     Rangpur          NaN          7

<h1>Merge two DataFrames with same Columns</h1>

In [12]:
tmp_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'temperature': [32, 40, 38]
})

tmp_df

         city  temperature
0    Dinajpur           32
1       Dhaka           40
2  Chittagong           38

In [13]:
new_tmp_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'temperature': [32, 40, 38],
    'humidity': [80, 60, 90]
})

new_tmp_df

         city  temperature  humidity
0    Dinajpur           32        80
1       Dhaka           40        60
2  Chittagong           38        90

<h3>Without Suffixes</h3>

In [14]:
df = pd.merge(tmp_df, new_tmp_df, on='city')
df

         city  temperature_x  temperature_y  humidity
0    Dinajpur             32             32        80
1       Dhaka             40             40        60
2  Chittagong             38             38        90

<h3>With Suffixes</h3>

In [15]:
df = pd.merge(tmp_df, new_tmp_df, on='city', suffixes=('_left', '_right'))
df

         city  temperature_left  temperature_right  humidity
0    Dinajpur                32                 32        80
1       Dhaka                40                 40        60
2  Chittagong                38                 38        90